HELYXcore-4.4.0/examples/legacy/multiphase/reactingTwoPhaseEulerFoam/RAS/LBend/0/T.solids
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T.solids;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 0 0 1 0 0 0];

internalField       uniform 300;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.solids;
        inletValue      uniform 300;
        value           uniform 300;
    }

    "wall.*"
    {
        type            zeroGradient;
    }

    "frontAndBack.*"
    {
        type            empty;
    }
}

// ************************************************************************* //
