HELYXcore-4.4.0/examples/legacy/multiphase/reactingTwoPhaseEulerFoam/RAS/LBend/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type    heatAndMomentumTransferTwoPhaseSystem;

phases (solids gas);

solids
{
    type          purePhaseModel;

    diameterModel constant;

    constantCoeffs
    {
        d               462e-6;
    }

    residualAlpha   1e-5;
}

gas
{
    type          purePhaseModel;

    diameterModel constant;
    constantCoeffs
    {
        d               1;
    }
    residualAlpha   1e-5;
}

blending
{
    default
    {
        type            none;
        residualAlpha   1e-6;
        continuousPhase gas;
    }
}

surfaceTension
(
    (gas and solids)
    {
        type            constant;
        sigma           0;
    }
);

aspectRatio
(
);

drag
(
    (solids in gas)
    {
        type            GidaspowErgunWenYu;
        residualAlpha   1e-5;
        residualRe      1e-5;
        swarmCorrection
        {
            type        none;
        }
    }
);

virtualMass
(
    (solids in gas)
    {
        type            constantCoefficient;
        Cvm             0;
    }
);

heatTransfer
(
    (solids in gas)
    {
        type            RanzMarshall;
        residualAlpha   1e-4;
    }
);

lift
(
);

wallLubrication
(
);

turbulentDispersion
(
);

// Minimum allowable pressure
pMin            10000;


// ************************************************************************* //
